In [1]:
#identifying null values

#In Python, specifically Pandas, and NumPy, we mark missing values as NaN. Values with a NaN value are ignored from 
#operations like sum, count, etc. 
import pandas as pd
import numpy as np
df1 = pd.DataFrame({'C1':[11,21,np.nan] , 'C2':[15,np.nan ,np.nan] , 'C3':[10,20,30] })

In [3]:
print(df1)

     C1    C2  C3
0  11.0  15.0  10
1  21.0   NaN  20
2   NaN   NaN  30

In [4]:
#to identify null values from given data set
#isna()-Is any NUll entry...is used
df1.isna()

      C1     C2     C3
0  False  False  False
1  False   True  False
2   True   True  False

In [5]:
#using df1.isna().sum() command we get column wise null values count.
df1.isna().sum()

C1    1
C2    2
C3    0
dtype: int64

In [7]:
#removing rows with missing values
#df1.dropna()
df1.fillna(df1.mean()) #mean values of column are calculated

     C1    C2  C3
0  11.0  15.0  10
1  21.0  15.0  20
2  16.0  15.0  30

In [9]:
import pandas as pd
import numpy as np
file_path = r"C:\Users\nidhi\OneDrive\Desktop\projects\DA\Cars93.csv"
df = pd.read_csv( file_path)
df.head()

,Unnamed: 0,Manufacturer,Model,Type,Min.Price,Price,Max.Price,MPG.city,MPG.highway,AirBags,...,Passengers,Length,Wheelbase,Width,Turn.circle,Rear.seat.room,Luggage.room,Weight,Origin,Make
0,1,Acura,Integra,Small,12.9,15.9,18.8,25,31,None,...,5,177,102,68,37,26.5,11.0,2705,non-USA,Acura Integra
1,2,Acura,Legend,Midsize,29.2,33.9,38.7,18,25,Driver & Passenger,...,5,195,115,71,38,30.0,15.0,3560,non-USA,Acura Legend
2,3,Audi,90,Compact,25.9,29.1,32.3,20,26,Driver only,...,5,180,102,67,37,28.0,14.0,3375,non-USA,Audi 90
3,4,Audi,100,Midsize,30.8,37.7,44.6,19,26,Driver & Passenger,...,6,193,106,70,37,31.0,17.0,3405,non-USA,Audi 100
4,5,BMW,535i,Midsize,23.7,30.0,36.2,22,30,Driver only,...,4,186,109,69,39,27.0,13.0,3640,non-USA,BMW 535i

In [11]:
df.shape

(93, 28)

In [12]:
df.isna().sum()

Unnamed: 0             0
Manufacturer           0
Model                  0
Type                   0
Min.Price              0
Price                  0
Max.Price              0
MPG.city               0
MPG.highway            0
AirBags                0
DriveTrain             0
Cylinders              0
EngineSize             0
Horsepower             0
RPM                    0
Rev.per.mile           0
Man.trans.avail        0
Fuel.tank.capacity     0
Passengers             0
Length                 0
Wheelbase              0
Width                  0
Turn.circle            0
Rear.seat.room         2
Luggage.room          11
Weight                 0
Origin                 0
Make                   0
dtype: int64

In [16]:
df['Luggage.room'].mean()

13.890243902439025

In [17]:
df['Luggage.room'].median()

14.0

In [22]:
#replacing null values of the column with median of the column
import pandas as pd
import numpy as np
file_path = r"C:\Users\nidhi\OneDrive\Desktop\projects\DA\Cars93.csv"
df = pd.read_csv( file_path)
df.isna().sum()
df['Luggage.room']=df['Luggage.room'].fillna(value=df['Luggage.room'].median())

In [25]:
import pandas as pd
import numpy as np
file_path = r"C:\Users\nidhi\OneDrive\Desktop\projects\DA\Cars93.csv"
df = pd.read_csv( file_path)
df.isna().sum()
df['Rear.seat.room']=df['Rear.seat.room'].fillna(value=df['Rear.seat.room'].median())

In [40]:
#Data-bining
import pandas as pd
import numpy as np

df1 = {'Name': ['unnati', 'nidhi', 'sonal', 'ritika', 'unnati', 'niharika', 'arshiya', 'tanisha'],
       'Score': [63, 66, 56, 75, 32, 77, 85, 22]}
df1 = pd.DataFrame(df1, columns=['Name', 'Score'])
print(df1)

       Name  Score
0    unnati     63
1     nidhi     66
2     sonal     56
3    ritika     75
4    unnati     32
5  niharika     77
6   arshiya     85
7   tanisha     22

In [41]:
#grouping these scores
bins = [0,25,50,75,100]
df1['binned'] = pd.cut(df1['Score'], bins)
print(df1)

       Name  Score     binned
0    unnati     63   (50, 75]
1     nidhi     66   (50, 75]
2     sonal     56   (50, 75]
3    ritika     75   (50, 75]
4    unnati     32   (25, 50]
5  niharika     77  (75, 100]
6   arshiya     85  (75, 100]
7   tanisha     22    (0, 25]

In [42]:
bins = [0,25,50,75,100]
labels=['D','C','B','A']
df1['binned'] = pd.cut(df1['Score'], bins,labels = labels)
df1

       Name  Score binned
0    unnati     63      B
1     nidhi     66      B
2     sonal     56      B
3    ritika     75      B
4    unnati     32      C
5  niharika     77      A
6   arshiya     85      A
7   tanisha     22      D

In [47]:
#using random from pandas
import numpy as np
x=np.random.uniform(0.0,1.0,size=(10,2))
y=np.random.choice(('Male','Female'),size=(10))
x
y

array(['Male', 'Female', 'Male', 'Male', 'Female', 'Female', 'Female',
       'Male', 'Female', 'Female'], dtype='<U6')